#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
digitalocean_domain.rileysnyder_org: Refreshing state... [id=rileysnyder.org]
digitalocean_record.metrics: Refreshing state... [id=284235809]
digitalocean_record.minecraft: Refreshing state... [id=284235811]
digitalocean_record.public: Refreshing state... [id=284236325]
digitalocean_record.instance["oc6"]: Refreshing state... [id=284239298]
digitalocean_record.instance["oca2"]: Refreshing state... [id=284239297]
digitalocean_record.instance["oc1"]: Refreshing state... [id=284239301]
digitalocean_record.instance["oca3"]: Refreshing state... [id=284239302]
digitalocean_record.instance["oc8"]: Refreshing state... [id=284239314]
digitalocean_record.instance["oc5"]: Refreshing state... [id=284239307]
digitalocean_record.instance["oca9"]: Refreshing state... [id=284239306]
digitalocean_record.instance["oc4"]: Refreshing state... [id=284239305]
digitalocean_record.instance["oca4"]: Refreshing state... [id=284239296]
digitalocean_record.instance["oc7"]: Refreshing state... [id=284239308]
digitalocean_record.instance["oca6"]: Refreshing state... [id=284239299]
digitalocean_record.instance["oc0"]: Refreshing state... [id=284239303]
digitalocean_record.instance["oca7"]: Refreshing state... [id=284239313]
digitalocean_record.instance["oc2"]: Refreshing state... [id=284239311]
digitalocean_record.instance["oca5"]: Refreshing state... [id=284239312]
digitalocean_record.instance["oca8"]: Refreshing state... [id=284239310]
digitalocean_record.instance["oc3"]: Refreshing state... [id=284239300]
digitalocean_record.instance["oc9"]: Refreshing state... [id=284239295]
digitalocean_record.instance["wubby"]: Refreshing state... [id=284239304]
digitalocean_record.tracker: Refreshing state... [id=284236322]
digitalocean_record.lighthouse: Refreshing state... [id=284235812]
digitalocean_record.files: Refreshing state... [id=284235810]
digitalocean_record.qbittorrent: Refreshing state... [id=284236320]
digitalocean_record.code: Refreshing state... [id=284235813]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_record.thoughts will be created
  + resource "digitalocean_record" "thoughts" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "thoughts"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "rssnyder.github.io"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rssnyder, Action: `pull_request`*